In [18]:
# How to find version
import pandas as pd
print(pd.__version__)

1.4.3

In [19]:
# another way
pd.show_versions()

C:\Program Files\WindowsApps\PythonSoftwareFoundation.Python.3.10_3.10.2288.0_x64__qbz5n2kfra8p0\lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : e8093ba372f9adfe79439d90fe74b0b5b6dea9d6
python           : 3.10.8.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22621
machine          : AMD64
processor        : Intel64 Family 6 Model 140 Stepping 1, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.3
numpy            : 1.23.2
pytz             : 2022.2.1
dateutil         : 2.8.2
setuptools       : 63.2.0
pip              : 22.3.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.4.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : 2.1.1
matplotlib       : 3.5.3
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.0
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

In [20]:
# Make a data frame
df = pd.DataFrame({'col1': [1, 2,3,4], 'col2': [0.1, 0.2,.3,.4]}, index=['a', 'b', 'c', 'd'])
df

   col1  col2
a     1   0.1
b     2   0.2
c     3   0.3
d     4   0.4

In [21]:
# numpy array
import numpy as np
arr = np.array([[1, 2, 3], [4, 5, 6]])
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6

In [22]:
#Numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.967930,0.066280,0.931878,0.751586,0.362534,0.067296,0.378541,0.079511
1,0.026050,0.805042,0.171938,0.659093,0.669920,0.996829,0.470042,0.853360
2,0.781453,0.930047,0.963153,0.645145,0.610163,0.591965,0.821874,0.783618
3,0.727747,0.998444,0.248779,0.974075,0.730919,0.945452,0.153425,0.667214

In [23]:
# How to rename columns
df.rename(columns={'col1':'col_a','col2':'col_b'},inplace=True)
df

   col_a  col_b
a      1    0.1
b      2    0.2
c      3    0.3
d      4    0.4

In [24]:
# How to replace character /string
df.columns = df.columns.str.replace('_','-')
df

   col-a  col-b
a      1    0.1
b      2    0.2
c      3    0.3
d      4    0.4

In [25]:
# adding prefix to column names
df = df.add_prefix('pre_')
df

   pre_col-a  pre_col-b
a          1        0.1
b          2        0.2
c          3        0.3
d          4        0.4

In [26]:
# Using template data
import seaborn as sns
data = sns.load_dataset('iris')
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [27]:
# Reverse Row order
import seaborn as sns
import numpy as np
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [28]:
df.shape

(244, 7)

In [29]:
df.loc[::-1].head()

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3

In [30]:
df.loc[::-1].reset_index(drop=True).head()

   total_bill   tip     sex smoker   day    time  size
0       18.78  3.00  Female     No  Thur  Dinner     2
1       17.82  1.75    Male     No   Sat  Dinner     2
2       22.67  2.00    Male    Yes   Sat  Dinner     2
3       27.18  2.00  Female    Yes   Sat  Dinner     2
4       29.03  5.92    Male     No   Sat  Dinner     3

In [31]:
# Reverse the column order
df.loc[:,::-1].head()

   size    time  day smoker     sex   tip  total_bill
0     2  Dinner  Sun     No  Female  1.01       16.99
1     3  Dinner  Sun     No    Male  1.66       10.34
2     3  Dinner  Sun     No    Male  3.50       21.01
3     2  Dinner  Sun     No    Male  3.31       23.68
4     4  Dinner  Sun     No  Female  3.61       24.59

In [32]:
# Select a column by  dtype
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [33]:
# Only select those having float
df.select_dtypes(include=['category']).head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [34]:
df.select_dtypes(include=['float64']).head()

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [35]:
df.select_dtypes(include=['float64','int64']).head()

   total_bill   tip  size
0       16.99  1.01     2
1       10.34  1.66     3
2       21.01  3.50     3
3       23.68  3.31     2
4       24.59  3.61     4

In [36]:
df.select_dtypes(exclude=['float64']).head()

      sex smoker  day    time  size
0  Female     No  Sun  Dinner     2
1    Male     No  Sun  Dinner     3
2    Male     No  Sun  Dinner     3
3    Male     No  Sun  Dinner     2
4  Female     No  Sun  Dinner     4

In [37]:
# Convert string into numbers
df1 = pd.DataFrame({'col1': [1, 2,3,4], 'col2': [0.1, 0.2,.3,.4]}, index=['a', 'b', 'c', 'd'])

In [38]:
df1.dtypes

col1      int64
col2    float64
dtype: object

In [39]:
df1.astype({'col1':'float64'}).dtypes

col1    float64
col2    float64
dtype: object

In [40]:
pd.to_numeric(df1['col1'])
df1.dtypes

col1      int64
col2    float64
dtype: object

In [41]:
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [42]:
# Memory usage
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [43]:
#Reducing the data frame
data.sample(frac=.1).shape

(15, 5)

In [ ]:
pip install pandas_profiling

In [ ]:

pip install ipywidgets

In [ ]:
# pandas profiling
import pandas_profiling
pandas_profiling.ProfileReport(data)